In [1]:

import numpy as np 
import pandas as pd

## Creating a Dataframe

In [2]:
data = {
    'Name': ['Satyam', 'Shivam', 'Peter', 'Linda'],
     'Age':[28, 34, 29, 42],
     'City':['New York', 'Paris', 'Berlin', 'London'],
     'Salary': [65000, 70000, 62000, 85000]
}
pd.DataFrame(data)

     Name  Age      City  Salary
0  Satyam   28  New York   65000
1  Shivam   34     Paris   70000
2   Peter   29    Berlin   62000
3   Linda   42    London   85000

In [5]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
columns = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_list, columns=columns)

In [6]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

# Selection and Indexing of Columns

In [7]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [9]:
df2[['Name', 'City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

# Creating a New Column

In [10]:
df2['Designation'] = ['Engineer', 'Doct', 'Engineer', 'Doct']

In [11]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000    Engineer
1   Anna   34     Paris   70000        Doct
2  Peter   29    Berlin   62000    Engineer
3  Linda   42    London   85000        Doct

# Removing Columns

In [15]:
df2.drop('Designation', axis=1, inplace=True)

In [17]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

# Selecting Rows

In [18]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [21]:
df2.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [22]:
df2.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

# Selecting subsets of Rows and Columns

In [24]:
df2.loc[[0,1]][['City', 'Salary']]

       City  Salary
0  New York   65000
1     Paris   70000

In [25]:
df2.loc[[2,3]][['Name', 'Age']]

    Name  Age
2  Peter   29
3  Linda   42

# Conditional Selection

In [26]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [28]:
# I only want to see those people whose age is above 30.

In [29]:
df2[df2['Age']>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [ ]:
# I only want people whose age is above 30 and their city must be Paris.

In [32]:
df2[(df2['Age']>30) & (df2['City'] == 'Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000